<template>

  <!--regions-->
  <section class="b-regions__wrapper g-wrapper">
    <div class="container">
      <div class="row">
        <div class="col-lg-6 col-sm-12 d-flex">
          <h2 class="b-regions__title">Работаем со всеми регионами РФ</h2>
          <div class="b-regions__subtitle">Доставим готовый обеменный агрегат до вашего адреса</div>
          <div class="b-regions__accent">в течение суток</div>
        </div>
        <div class="col-lg-6 col-sm-12">
          <figure>
            <img src="@/assets/img/Rectangle8.png" alt="" class="img-responsive">
            <figcaption>Полный капитальный ремонт коробки передач</figcaption>
            <p>Производится замена деталей — от подшипников до механизма переключения передач</p>
          </figure>
        </div>
      </div>
    </div>
  </section>

  
  <!--quiz-->
  <Quiz></Quiz>

  <!--catalog-->
  <Catalog></Catalog>

  <!--get_unit-->
  <section class="b-get-unit__wrapper g-wrapper">
    <div class="container">
      <div class="row just-sb align-ic">
        <div class="col-lg-5 col-sm-12">
          <img src="@/assets/img/Rectangle30.jpg" alt="" class="img-responsive">
        </div>

        <div class="col-lg-6 col-sm-12">
          <h2 class="b-get-unit__title">Получите агрегат в течение суток</h2>
          <div class="b-get-unit__subtitle">Гарантия 12 мес. или 2 500 м/ч</div>
          <div class="b-get-unit__text">У нас в наличии большой запас коробок передач. Это восстановленные КПП с
            обкаткой и пройденными гидравлическими испытаниями. Гарантия, как для новых агрегатов с завода!</div>
          <div class="b-get-unit__action">
            <a href="#" class="btn_primary" data-open-popup @click="pop_up_open">Запросить наличие нужного агрегата</a>
          </div>
        </div>
      </div>
    </div>
  </section>

  <!--documents-->
  <BoxDocs></BoxDocs>

  <!--delivery-->
  <section class="b-delivery__wrapper g-wrapper">
    <div class="container">
      <div class="row">
        <div class="col-lg-8 col-sm-12 order-lg-1 order-sm-2">
          <h2 class="b-delivery__title">Доставка по России и СНГ</h2>
          <div class="b-delivery__subtitle">Привезём по указанному адресу на своём транспорте</div>
          <ul class="b-delivery__items">
            <li class="b-delivery__item__wrapper">
              <div class="b-delivery__item">
                <svg xmlns="http://www.w3.org/2000/svg" width="60" height="52" viewBox="0 0 60 52" fill="none">
                  <path d="M45 4.76633e-08L60 26L45 52H15L0 26L15 0L45 4.76633e-08Z" fill="black" />
                  <path d="M45 4.76633e-08L15 52L0 26L15 0L45 4.76633e-08Z" fill="#424653" />
                  <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M17.1979 17.1622L17.0192 17.3244L17.0035 24.5135C16.9949 28.4675 17.0027 31.7865 17.0208 31.8892C17.0389 31.9919 17.1173 32.1357 17.1949 32.2089C17.3319 32.3378 17.3629 32.3418 18.2343 32.3418C19.404 32.3418 19.4381 32.324 19.5908 31.6328C19.9258 30.1162 21.1742 29.1178 22.7356 29.1178C24.2809 29.1178 25.5488 30.1318 25.8804 31.6328C25.9764 32.0676 26.0339 32.1768 26.2192 32.2771C26.3067 32.3244 27.3307 32.3418 30.0389 32.3418H33.7391L33.899 32.1793L34.0589 32.0168L34.0577 24.6891C34.0565 17.8301 34.0504 17.3537 33.9619 17.2427C33.9099 17.1775 33.8136 17.0962 33.7479 17.0621C33.6615 17.0172 31.3796 17 25.5025 17H17.3765L17.1979 17.1622ZM35.6061 20.1518C35.5394 20.1649 35.4225 20.251 35.3462 20.3431L35.2076 20.5104V26.2551V31.9997L35.3759 32.1707C35.5397 32.3372 35.5579 32.3418 36.0523 32.3418C36.708 32.3418 36.805 32.2752 36.924 31.7435C37.1053 30.9339 37.4148 30.3611 37.9102 29.9183C39.251 28.7201 41.5849 28.9048 42.6169 30.2907C42.9448 30.731 43.106 31.0795 43.2456 31.6497C43.3979 32.2719 43.4871 32.3418 44.129 32.3418C44.6854 32.3418 44.8453 32.2737 44.9404 31.9963C45.0137 31.7827 45.0223 26.2406 44.9497 26.0465C44.8673 25.8262 40.3015 20.316 40.1136 20.2101C39.9569 20.1218 39.747 20.1135 37.8342 20.1204C36.6754 20.1246 35.6727 20.1387 35.6061 20.1518ZM36.5077 21.4423L36.329 21.6045V23.2534V24.9023L36.5077 25.0645L36.6863 25.2267H39.2796H41.8729L42.0349 25.0882C42.2159 24.9334 42.275 24.6948 42.1859 24.4788C42.1008 24.2723 39.8016 21.4756 39.63 21.3697C39.5065 21.2935 39.2758 21.2801 38.0855 21.2801H36.6863L36.5077 21.4423ZM22.1976 30.2592C20.6393 30.6029 19.8718 32.5022 20.7318 33.8866C21.2214 34.6747 22.2056 35.1247 23.0992 34.9692C24.006 34.8113 24.7107 34.1893 25.0059 33.2862C25.1574 32.8227 25.1043 32.0845 24.8853 31.6091C24.5653 30.9148 23.9509 30.4081 23.2444 30.256C22.7958 30.1593 22.6481 30.1598 22.1976 30.2592ZM39.6776 30.2317C39.2545 30.304 38.7534 30.5752 38.429 30.9075C37.5015 31.8574 37.5026 33.3469 38.4315 34.2908C39.8078 35.6893 42.1329 34.9047 42.4339 32.9403C42.629 31.6672 41.7438 30.4384 40.4802 30.2282C40.1188 30.168 40.0486 30.1683 39.6776 30.2317ZM22.3756 32.0019C22.198 32.112 22.0245 32.416 22.0245 32.617C22.0245 32.9688 22.3716 33.2867 22.7559 33.2867C22.968 33.2867 23.0341 33.2577 23.1961 33.093C23.435 32.8503 23.491 32.5923 23.3639 32.3203C23.1844 31.9359 22.7224 31.787 22.3756 32.0019ZM39.7409 31.9907C39.4348 32.1837 39.3257 32.6355 39.5091 32.951C39.8541 33.5444 40.7878 33.2961 40.787 32.6111C40.7864 32.0843 40.1711 31.7194 39.7409 31.9907Z"
                    fill="white" />
                </svg>
                <b>Автотранспорт</b>
                <span>Стандарт</span>
              </div>
            </li>
            <li class="b-delivery__item__wrapper">
              <div class="b-delivery__item">
                <svg xmlns="http://www.w3.org/2000/svg" width="60" height="52" viewBox="0 0 60 52" fill="none">
                  <path d="M45 4.76633e-08L60 26L45 52H15L0 26L15 0L45 4.76633e-08Z" fill="black" />
                  <path d="M45 4.76633e-08L15 52L0 26L15 0L45 4.76633e-08Z" fill="#424653" />
                  <path fill-rule="evenodd" clip-rule="evenodd"
                    d="M25.6898 12.0308C25.6528 12.0448 25.5669 12.1104 25.499 12.1765L25.3755 12.2966V13.259V14.2214L26.6888 15.5998C27.4111 16.358 28.0671 17.0076 28.1465 17.0436C28.2465 17.0888 28.4782 17.1089 28.8986 17.1089H29.5061V17.4152C29.5061 17.6655 29.4918 17.7263 29.4276 17.7481C28.8754 17.935 28.4278 18.3396 28.169 18.8856C28.0207 19.1983 28.003 19.2765 27.9871 19.6901C27.9672 20.2064 28.0555 20.5774 28.2902 20.9638C28.7152 21.6637 29.5662 22.0709 30.3408 21.9449C31.137 21.8154 31.8129 21.1983 32.0387 20.3945C32.2066 19.7969 32.0694 19.3492 31.7061 19.3091C31.373 19.2724 31.2251 19.4196 31.143 19.8696C31.1084 20.0593 31.0295 20.3047 30.9676 20.415C30.7548 20.7942 30.2953 21.0078 29.852 20.9338C29.2626 20.8354 28.8361 20.1824 28.966 19.5772C29.0686 19.0989 29.3926 18.7924 29.8922 18.7012C30.4453 18.6002 30.4939 18.5172 30.4939 17.674V17.062H31.0944C31.4247 17.062 31.7631 17.0485 31.8464 17.032C31.969 17.0078 32.2439 16.7468 33.2876 15.6635C33.9969 14.9273 34.6081 14.2571 34.6458 14.1741C34.7461 13.9534 34.7443 12.5235 34.6435 12.3015C34.4982 11.9818 34.7377 11.9973 30.0157 12.0015C27.6735 12.0035 25.7268 12.0167 25.6898 12.0308ZM27.1265 20.9886C27.0895 21.0036 25.8238 21.9304 24.3139 23.0482L21.5686 25.0805L20.5649 25.0808C20.0129 25.0809 19.4867 25.1026 19.3957 25.129C19.3047 25.1554 19.1785 25.2413 19.1151 25.3199L19 25.4628L19.0002 30.5353C19.0003 35.4802 19.0025 35.6114 19.0878 35.7575C19.1459 35.857 19.2326 35.9246 19.3458 35.9588C19.468 35.9957 22.5216 36.0064 30.1272 35.9965L40.738 35.9828L40.869 35.8296L41 35.6765V30.5917C41 26.8491 40.9863 25.4756 40.9482 25.3882C40.8322 25.1223 40.7589 25.106 39.5633 25.0805L38.4633 25.0571L35.7245 23.0461C34.2182 21.94 32.9291 21.0144 32.8599 20.9891C32.7654 20.9546 32.6842 20.9631 32.5335 21.0232C32.1683 21.1688 32.1019 21.5456 32.3913 21.8297C32.4713 21.9082 33.496 22.6665 34.6684 23.5148L36.8002 25.0571L33.3965 25.0691C31.5246 25.0757 28.4812 25.0757 26.6336 25.0691L23.2743 25.0571L25.4741 23.44C26.889 22.3999 27.6964 21.7775 27.737 21.6956C27.818 21.5318 27.8167 21.4051 27.7319 21.2338C27.6241 21.0162 27.3417 20.9018 27.1265 20.9886ZM25.3395 28.5351C25.0644 28.6768 25.0612 28.6997 25.0612 30.5434C25.0612 32.3831 25.0658 32.4167 25.3368 32.5631C25.528 32.6663 25.7443 32.6171 25.8891 32.4373L26.0041 32.2946V30.5844C26.0041 28.6887 26.002 28.6738 25.7187 28.5334C25.5303 28.44 25.5243 28.4401 25.3395 28.5351ZM22.3366 28.5722C22.0596 28.698 22.0531 28.744 22.0531 30.5668C22.0531 32.3809 22.058 32.4169 22.3286 32.5631C22.5084 32.6602 22.7231 32.6195 22.8653 32.4615L22.9735 32.3412L22.9863 30.6343C23.0006 28.7283 22.9965 28.6985 22.7026 28.5702C22.5192 28.4902 22.5171 28.4902 22.3366 28.5722ZM28.3156 28.5756C28.047 28.714 28.0482 28.7055 28.0328 30.473C28.0234 31.5461 28.035 32.1492 28.0675 32.2641C28.1828 32.6725 28.6705 32.7634 28.9327 32.4253C29.003 32.3346 29.0104 32.1632 29.0113 30.589C29.0123 28.687 29.017 28.722 28.7424 28.5736C28.5806 28.4863 28.4879 28.4867 28.3156 28.5756ZM31.3116 28.5743C31.0375 28.6986 31.0279 28.7735 31.0423 30.667L31.0551 32.3565L31.2017 32.4933C31.3115 32.5957 31.3931 32.63 31.5265 32.63C31.6599 32.63 31.7415 32.5957 31.8513 32.4933L31.998 32.3565L32.0108 30.6634C32.0252 28.7721 32.0182 28.7206 31.7296 28.5775C31.5493 28.4882 31.502 28.4878 31.3116 28.5743ZM34.3243 28.5704C34.0456 28.7006 34.0408 28.7356 34.0408 30.6547V32.3884L34.1558 32.5311C34.3044 32.7156 34.516 32.7597 34.7339 32.6518C34.8236 32.6073 34.9215 32.5262 34.9516 32.4716C34.9918 32.3984 35.0061 31.9057 35.0061 30.6029V28.8337L34.8714 28.6932C34.7088 28.5235 34.5169 28.4805 34.3243 28.5704ZM37.2879 28.5792C37.0139 28.7204 37.0041 28.7891 37.0041 30.5637C37.0041 32.2805 37.0173 32.3952 37.2338 32.5536C37.4569 32.7167 37.8159 32.6203 37.9417 32.3635C38.0059 32.2323 38.0118 28.9864 37.9481 28.8115C37.899 28.6767 37.6574 28.5034 37.5204 28.5049C37.471 28.5053 37.3664 28.5388 37.2879 28.5792Z"
                    fill="white" />
                </svg>
                <b>Контейнерами по ЖД</b>
                <span>По запросу</span>
              </div>
            </li>
          </ul>
        </div>
        <div class="col-lg-4 col-sm-12 order-lg-1 order-sm-1">
          <img src="@/assets/img/Rectangle90.jpg" alt="" class="img-responsive">
        </div>
      </div>
    </div>
  </section>

  <!--brands -->
  <Brands></Brands>

  <!--repair-->
  <RemontKpp></RemontKpp>

  <!--specialists-->
  <Specialists></Specialists>

  <!--responsibility-->
  <section class="b-responsibility__wrapper g-wrapper">
    <div class="container">
      <div class="row align-ic just-sb">
        <div class="order-lg-1 order-sm-2 col-lg-7 col-sm-12">
          <h2 class="b-responsibility__title">Несем ответственность по договору</h2>
          <div class="b-responsibility__text">
            При отгрузке КПП (ГТР) предоставляется гарантийный талон сроком до одного года и полный комплект
            документации
          </div>
          <ul class="b-responsibility__list">
            <li>Акт выполненных работ</li>
            <li>Товарные накладные</li>
            <li>Транспортные накладные</li>
            <li>Счёт</li>
          </ul>
        </div>
        <div class="order-sm-1 col-lg-5 col-sm-12">
          <img src="@/assets/img/Rectangle42.jpg" alt="" class="img-responsive">
        </div>
      </div>
    </div>
  </section>

  <!--order-->
  <section class="b-order__wrapper g-wrapper">
    <div class="container">
      <div class="b-order__title">Наши агрегаторы работают по все России от Брянска до Хабаровска, от Коми и Ямала до
        Краснодара, а так же в странах СНГ</div>
      <div class="b-order__action">
        <a href="#" class="btn_primary" data-open-popup @click.prevent="pop_up_open">Заказать звонок</a>
        <span>Или звоните</span>
        <a href="tel:+79195150777">+7 919 515 07 77</a>
      </div>
    </div>
  </section>
</template>

<script setup>

//import { ref, onMounted, onUnmounted, nextTick } from 'vue'

import Quiz from "@/components/home/Quiz.vue" 
import Catalog from "@/components/home/Catalog.vue"
import RemontKpp from "@/components/home/RemontKpp.vue" 
import BoxDocs from "@/components/home/BoxDocs.vue"
import Specialists from "@/components/home/Specialists.vue"
import Brands from "@/components/home/Brands.vue"


import { useStore } from 'vuex'

const store = useStore()

function pop_up_open(){
  store.dispatch('update_pop_up', true)
}

//const isVisible = ref(false);
// let observer, element;

// onMounted(async () => {
//     await nextTick();  // Ждем следующего обновления DOM

//     const element = document.querySelector('#elementToObserve');
//     if (element) {
//         const observer = new IntersectionObserver(
//             (entries) => {
//                 if (entries[0].isIntersecting) {
//                     isVisible.value = true;
//                     observer.disconnect(); // Отключаем наблюдение
//                 }
//             },
//             {
//                 root: null,
//                 threshold: 0.1
//             }
//         );

//         observer.observe(element);
//     }
// });

// onUnmounted(() => {
//     if (observer && element) {
//         observer.disconnect(); // Чистим наблюдатель
//     }
// });



</script>

<style>
.fade-in {
  opacity: 0;
  transform: translateY(20px);
  transition: opacity 0.5s ease, transform 0.5s ease;
}

.fade-in.visible {
  opacity: 1;
  transform: translateY(0);
}
</style>
